
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * module.case-disposer-action-group.azurerm_resource_group_template_deployment.action-group
  * module.case-disposer-deletion-failure-alert.azurerm_resource_group_template_deployment.custom_alert[0]
* Replace
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] must be replaced
-/+ resource "azurerm_monitor_activity_log_alert" "main" {
      ~ id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/lau-prod/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - lau-prod" -> (known after apply)
      ~ location            = "global" -> "westeurope" # forces replacement
        name                = "Application Insights daily cap reached - lau-prod"
        tags                = {
            "application"         = "log-and-audit"
            "builtFrom"           = "https://github.com/HMCTS/lau-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#lau-dev"
            "environment"         = "production"
            "managedBy"           = "LAU"
        }
        # (4 unchanged attributes hidden)

      ~ criteria {
          - levels                  = [] -> null
          - resource_groups         = [] -> null
          - resource_ids            = [] -> null
          - resource_providers      = [] -> null
          - resource_types          = [] -> null
          - statuses                = [] -> null
          - sub_statuses            = [] -> null
            # (13 unchanged attributes hidden)

          ~ resource_health {
              + caller                  = (known after apply)
              + category                = (known after apply)
              + level                   = (known after apply)
              + levels                  = (known after apply)
              + operation_name          = (known after apply)
              + recommendation_category = (known after apply)
              + recommendation_impact   = (known after apply)
              + recommendation_type     = (known after apply)
              + resource_group          = (known after apply)
              + resource_groups         = (known after apply)
              + resource_id             = (known after apply)
              + resource_ids            = (known after apply)
              + resource_provider       = (known after apply)
              + resource_providers      = (known after apply)
              + resource_type           = (known after apply)
              + resource_types          = (known after apply)
              + status                  = (known after apply)
              + statuses                = (known after apply)
              + sub_status              = (known after apply)
              + sub_statuses            = (known after apply)
            } -> (known after apply)

          ~ service_health {
              + caller                  = (known after apply)
              + category                = (known after apply)
              + level                   = (known after apply)
              + levels                  = (known after apply)
              + operation_name          = (known after apply)
              + recommendation_category = (known after apply)
              + recommendation_impact   = (known after apply)
              + recommendation_type     = (known after apply)
              + resource_group          = (known after apply)
              + resource_groups         = (known after apply)
              + resource_id             = (known after apply)
              + resource_ids            = (known after apply)
              + resource_provider       = (known after apply)
              + resource_providers      = (known after apply)
              + resource_type           = (known after apply)
              + resource_types          = (known after apply)
              + status                  = (known after apply)
              + statuses                = (known after apply)
              + sub_status              = (known after apply)
              + sub_statuses            = (known after apply)
            } -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.case-disposer-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-shared-prod/providers/Microsoft.Resources/deployments/dispr-alert"
        name                     = "dispr-alert"
      ~ output_content           = jsonencode({}) -> (known after apply)
      ~ parameters_content       = (sensitive value)
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              + outputs        = {
                  + actionGroupId = {
                      + type  = "string"
                      + value = "[resourceId('microsoft.insights/actionGroups', parameters('actionGroupName'))]"
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.case-disposer-deletion-failure-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-shared-prod/providers/Microsoft.Resources/deployments/ccd-case-disposer-prod-failures"
        name                     = "ccd-case-disposer-prod-failures"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":83,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->